app/Http/Controllers/Auth/RegisteredUserController.php

    public function create()
    {
        //Subjectsテーブルの情報を取得
        //auth/register.blade.phpという"ビュー"をブラウザに表示させる
        $subjects = Subjects::all();
---
select * from `subjects`