app/Http/Controllers/Authenticated/Users/UsersController.php

select * from `subjects`
---
    public function showUsers(Request $request){
        $keyword = $request->keyword;
        $category = $request->category;
        $updown = $request->updown;
        $gender = $request->sex;
        $role = $request->role;
        $subjects = null;// ここで検索時の科目を受け取る
        $userFactory = new SearchResultFactories();
        $users = $userFactory->initializeUsers($keyword, $category, $updown, $gender, $role, $subjects);
        $subjects = Subjects::all();

select * from `users` where `users`.`id` = '4' and `users`.`deleted_at` is null limit 1
select `subjects`.*, `subject_users`.`user_id` as `pivot_user_id`, `subject_users`.`subject_id` as `pivot_subject_id` from `subjects` inner join `subject_users` on `subjects`.`id` = `subject_users`.`subject_id` where `subject_users`.`user_id` in (4)
select * from `subjects`
---
    public function userProfile($id){
        $user = User::with('subjects')->findOrFail($id);
        $subject_lists = Subjects::all();