app/Http/Controllers/Authenticated/BulletinBoard/PostsController.php

select * from `posts` where `post_title` like '%英語%' or `post` like '%英語%' or exists (select * from `sub_categories` inner join `post_sub_categories` on `sub_categories`.`id` = `post_sub_categories`.`sub_category_id` where `posts`.`id` = `post_sub_categories`.`post_id` and `sub_category` = '英語')
---
    public function show(Request $request){
        //postテーブルからリレーションで紐付けたuser・postComments・subCategoriesテーブルの情報を取得
        $posts = Post::with('user', 'postComments', 'subCategories')->get();
        $categories = MainCategory::get();
        $like = new Like;
        $post_comment = new Post;

        //キーワード検索の場合
          //$request->keyword が送信されている場合（空でない場合）に実行
        if(!empty($request->keyword)){
            $sub_category = $request->category_word;
            $posts = Post::with('user', 'postComments')
            //タイトルのあいまい検索
            ->where('post_title', 'like', '%'.$request->keyword.'%')
            //投稿内容のあいまい検索
            ->orWhere('post', 'like', '%' . $request->keyword . '%')
            //サブカテゴリー名と完全一致する投稿を取得
              //「投稿（Post）」モデルが「サブカテゴリー（SubCategory）」と多対多のリレーションを持っている場合
              //投稿が持つ「サブカテゴリー」の中に条件を満たすものがあるかを確認
              //検索ワード（$request）と一致するものがある投稿を取得
            ->orWhereHas('subCategories', function ($query) use ($request) {
                //サブカテゴリーの条件を指定
                //サブカテゴリーテーブル（sub_categories）のサブカテゴリー名が、$request（検索されたキーワード）と一致するものだけを選ぶ
                $query->where('sub_category', $request->keyword);
            })->get();

select * from `post_comments` where `post_comments`.`post_id` in (10)
select * from `users` where `users`.`id` in (7) and `users`.`deleted_at` is null
---
    public function postDetail($post_id){
        $post = Post::with('user', 'postComments')->findOrFail($post_id);

select * from `main_categories`
---
    public function postInput(){
        $main_categories = MainCategory::get();