app/Http/Controllers/Authenticated/BulletinBoard/PostsController.php

    public function show(Request $request){
        //postテーブルからリレーションで紐付けたuser・postComments・subCategoriesテーブルの情報を取得
        $posts = Post::with('user', 'postComments', 'subCategories')->get();
        $categories = MainCategory::get();
        $like = new Like;
        $post_comment = new Post;
        if(!empty($request->keyword)){
            $posts = Post::with('user', 'postComments')
            ->where('post_title', 'like', '%'.$request->keyword.'%')
            ->orWhere('post', 'like', '%'.$request->keyword.'%')->get();
        }else if($request->category_word){
            $sub_category = $request->category_word;
            $posts = Post::with('user', 'postComments')->get();
---
select * from `post_comments` where `post_comments`.`post_id` in (10, 11, 12, 13)
select * from `posts`
select * from `users` where `users`.`id` in (7, 8, 9) and `users`.`deleted_at` is null
select `sub_categories`.*, `post_sub_categories`.`post_id` as `pivot_post_id`, `post_sub_categories`.`sub_category_id` as `pivot_sub_category_id` from `sub_categories` inner join `post_sub_categories` on `sub_categories`.`id` = `post_sub_categories`.`sub_category_id` where `post_sub_categories`.`post_id` in (10, 11, 12, 13)
select * from `main_categories`

    public function postDetail($post_id){
        $post = Post::with('user', 'postComments')->findOrFail($post_id);
---
select * from `post_comments` where `post_comments`.`post_id` in (12)
select * from `posts` where `posts`.`id` = '12' limit 1
select * from `users` where `users`.`id` in (8) and `users`.`deleted_at` is null

    public function postInput(){
        $main_categories = MainCategory::get();
---
select * from `main_categories`

    public function postCreate(PostFormRequest $request){
        // dd($request->post_category_id);
        $post = Post::create([
            'user_id' => Auth::id(),
            'post_title' => $request->post_title,
            'post' => $request->post_body
        ]);

        PostSubCategories::create([
            'post_id' => $post->id,
            //$requestはbladeから取得してくる値
            'sub_category_id' => $request->post_category_id,
        ]);
---
insert into `posts` (`user_id`, `post_title`, `post`, `updated_at`, `created_at`) values (7, 'ドリル', 'おすすめです！', '2024-12-10 14:01:46', '2024-12-10 14:01:46')
insert into `post_sub_categories` (`post_id`, `sub_category_id`, `created_at`) values (10, '4', '2024-12-10 14:01:46')

    public function postEdit(PostFormRequest $request){
        Post::where('id', $request->post_id)->update([
            'post_title' => $request->post_title,
            'post' => $request->post_body,
        ]);
---
update `posts` set `post_title` = 'おすすめの国語辞典', `post` = 'おすすめ！！', `posts`.`updated_at` = '2024-12-10 14:28:46' where `id` = '4'
select * from `posts` where `posts`.`id` = '10' limit 1

    public function postLike(Request $request){
        $user_id = Auth::id();
        $post_id = $request->post_id;

        $like = new Like;

        $like->like_user_id = $user_id;
        $like->like_post_id = $post_id;
        $like->save();
---
insert into `likes` (`like_user_id`, `like_post_id`, `updated_at`, `created_at`) values (7, '12', '2024-12-11 13:04:07', '2024-12-11 13:04:07')

    public function postUnLike(Request $request){
        $user_id = Auth::id();
        $post_id = $request->post_id;

        $like = new Like;

        $like->where('like_user_id', $user_id)
            ->where('like_post_id', $post_id)
            ->delete();
---
delete from `likes` where `like_user_id` = 7 and `like_post_id` = '12'