app/Models/Users/User.php

select `likes`.`id` from `likes` where `like_user_id` = 7 and `like_post_id` = 10 limit 1
---
    public function is_Like($post_id){
        return Like::where('like_user_id', Auth::id())->where('like_post_id', $post_id)->first(['likes.id']);