app/Http/Controllers/Authenticated/Calendar/General/CalendarController.php

select * from `reserve_settings` where `setting_reserve` = '2025-01-02' and `setting_part` = '1' limit 1
update `reserve_settings` set `limit_users` = `limit_users` - 1 where `id` = 58
---
    public function reserve(Request $request){
        DB::beginTransaction();
        try{
            $getPart = $request->getPart;
            $getDate = $request->getData;
            // dd($getDate, $getPart);
            $reserveDays = array_filter(array_combine($getDate, $getPart));
            foreach($reserveDays as $key => $value){
                $reserve_settings = ReserveSettings::where('setting_reserve', $key)->where('setting_part', $value)->first();
                $reserve_settings->decrement('limit_users');

select * from `reserve_settings` where `reserve_settings`.`id` is null limit 1
---
    public function deleteParts(Request $request){
        // dd($request);
        DB::beginTransaction();
        try {
            // フォームから送信された予約IDを取得
            // 'reserveId'フィールドを取得
            $reserveId = $request->input('reserveId');

            // 該当する予約設定を取得
            $reserveSettings = ReserveSettings::find($reserveId);