app/Models/Posts/Like.php

    public function likeCounts($post_id){
        return $this->where('like_post_id', $post_id)->get()->count();
---
select * from `likes` where `like_post_id` = 10