app/Models/Posts/PostComment.php

select * from `users` where `id` = 7 and `users`.`deleted_at` is null limit 1
---
    public function commentUser($user_id){
        return User::where('id', $user_id)->first();