app/Models/Posts/Post.php

select count(*) as aggregate from `likes` where `like_post_id` = 10
---
    public function getLikeCount(){
        return \App\Models\Posts\Like::where('like_post_id', $this->id)->count();