app/Calendars/General/CalendarWeekDay.php

select * from `reserve_settings` where `setting_reserve` = '2025-01-04' and `setting_part` = '1' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (64) and `users`.`deleted_at` is null
select * from `reserve_settings` where `setting_reserve` = '2025-01-04' and `setting_part` = '2' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (65) and `users`.`deleted_at` is null
select * from `reserve_settings` where `setting_reserve` = '2025-01-04' and `setting_part` = '3' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (66) and `users`.`deleted_at` is null
---
   function selectPart($ymd){
     $one_part_frame = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '1')->first();
     $two_part_frame = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '2')->first();
     $three_part_frame = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '3')->first();
     if($one_part_frame){
       $one_part_frame = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '1')->first()->limit_users;
     }else{
       $one_part_frame = '0';
     }
     if($two_part_frame){
       $two_part_frame = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '2')->first()->limit_users;
     }else{
       $two_part_frame = '0';
     }
     if($three_part_frame){
       $three_part_frame = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '3')->first()->limit_users;

select `reserve_settings`.*, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`id` as `pivot_id` from `reserve_settings` inner join `reserve_setting_users` on `reserve_settings`.`id` = `reserve_setting_users`.`reserve_setting_id` where `reserve_setting_users`.`user_id` = 7
---
   function authReserveDay(){
     return Auth::user()->reserveSettings->pluck('setting_reserve')->toArray();