app/Calendars/Admin/CalendarWeekDay.php

  function dayPartCounts($ymd){
    $html = [];

    //ReserveSettingsテーブルから、setting_reserveカラム(開講日)が $ymd(指定された日付)と一致するレコードを絞り込む
    $one_part_count = ReserveSettings::where('setting_reserve', $ymd)
      //setting_partカラムが 1（1部）と一致するレコードを絞り込む
      ->where('setting_part', '1')
      //予約設定に紐付けられた usersテーブルのレコード数(予約しているユーザーの人数)をカウント
      //この結果として、各予約設定に users_count という仮想カラムが追加される
      ->withCount('users')
      ->pluck('users_count')
      ->sum();

    $two_part_count = ReserveSettings::where('setting_reserve', $ymd)
    ->where('setting_part', '2')
    ->withCount('users')
    ->pluck('users_count')
    ->sum();

    $three_part_count = ReserveSettings::where('setting_reserve', $ymd)
    ->where('setting_part', '3')
    ->withCount('users')
    ->pluck('users_count')
    ->sum();
---
select `reserve_settings`.*, (select count(*) from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_settings`.`id` = `reserve_setting_users`.`reserve_setting_id` and `users`.`deleted_at` is null) as `users_count` from `reserve_settings` where `setting_reserve` = '2024-12-01' and `setting_part` = '2'
select `reserve_settings`.*, (select count(*) from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_settings`.`id` = `reserve_setting_users`.`reserve_setting_id` and `users`.`deleted_at` is null) as `users_count` from `reserve_settings` where `setting_reserve` = '2024-12-01' and `setting_part` = '3'

  function threePartFrame($day){
    $three_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '3')->first();
    if($three_part_frame){
      $three_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '3')->first()->limit_users;
---
select * from `reserve_settings` where `setting_reserve` = '2024-12-01' and `setting_part` = '3' limit 1
select * from `reserve_settings` where `setting_reserve` = '2024-12-23' and `setting_part` = '3' limit 1