app/Calendars/Admin/CalendarWeekDay.php

select * from `reserve_settings` where `setting_reserve` = '2024-12-01' and `setting_part` = '2' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (2) and `users`.`deleted_at` is null
select * from `reserve_settings` where `setting_reserve` = '2024-12-01' and `setting_part` = '3' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (3) and `users`.`deleted_at` is null
---
  function dayPartCounts($ymd){
    $html = [];
    $one_part = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '1')->first();
    $two_part = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '2')->first();
    $three_part = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '3')->first();

select * from `reserve_settings` where `setting_reserve` = '2024-12-22' and `setting_part` = '2' limit 1
---
  function onePartFrame($day){
    $one_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '1')->first();

select * from `reserve_settings` where `setting_reserve` = '2024-12-22' and `setting_part` = '3' limit 1
---
  function twoPartFrame($day){
    $two_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '2')->first();

select * from `reserve_settings` where `setting_reserve` = '2024-12-01' and `setting_part` = '1' limit 1
select * from `reserve_settings` where `setting_reserve` = '2024-12-23' and `setting_part` = '1' limit 1
---
  function threePartFrame($day){
    $three_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '3')->first();
    if($three_part_frame){
      $three_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '3')->first()->limit_users;